app/controllers/tour_programs_controller.rb

  def create
    @tour_program = TourProgram.new(tour_program_params)

    respond_to do |format|
      if @tour_program.save
---
INSERT INTO "tour_programs" ("created_at", "program_details", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-08-12 08:40:02.046853"], ["program_details", "<b>aok<br/></b>"], ["title", "aok"], ["updated_at", "2015-08-12 08:40:02.046853"]]

    def set_tour_program
      @tour_program = TourProgram.find(params[:id])
---
SELECT  "tour_programs".* FROM "tour_programs"  WHERE "tour_programs"."id" = ? LIMIT 1  [["id", 1]]